SELECT "Н_ОЦЕНКИ"."ПРИМЕЧАНИЕ",
       "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
FROM "Н_ОЦЕНКИ"
         RIGHT JOIN "Н_ВЕДОМОСТИ" ON "Н_ОЦЕНКИ"."КОД" = "Н_ВЕДОМОСТИ"."ОЦЕНКА"
WHERE "Н_ОЦЕНКИ"."КОД" > 'осв'
  AND "Н_ВЕДОМОСТИ"."ДАТА" > '2010-06-18';


SELECT "Н_ЛЮДИ"."ОТЧЕСТВО",
       "Н_ВЕДОМОСТИ"."ИД",
       "Н_СЕССИЯ"."ДАТА"
FROM "Н_ЛЮДИ"
         INNER JOIN "Н_СЕССИЯ" on "Н_ЛЮДИ"."ИД" = "Н_СЕССИЯ"."ЧЛВК_ИД"
         INNER JOIN "Н_ВЕДОМОСТИ" on "Н_СЕССИЯ"."СЭС_ИД" = "Н_ВЕДОМОСТИ"."СЭС_ИД"
WHERE "Н_ЛЮДИ"."ИД" = '100012'
  AND "Н_ВЕДОМОСТИ"."ДАТА" = '2022-06-08'
  AND "Н_СЕССИЯ"."ДАТА" > '2002-01-04';


SELECT COUNT("Н_УЧЕНИКИ"."ИД")
FROM "Н_УЧЕНИКИ"
         JOIN "Н_ЛЮДИ" НЛ on "Н_УЧЕНИКИ"."ЧЛВК_ИД" = НЛ."ИД" AND date_part('year', age(НЛ."ДАТА_РОЖДЕНИЯ"::date)) < 20
         JOIN "Н_ПЛАНЫ" НП on "Н_УЧЕНИКИ"."ПЛАН_ИД" = НП."ПЛАН_ИД"
         JOIN "Н_ФОРМЫ_ОБУЧЕНИЯ" НФО on НП."ФО_ИД" = НФО."ИД" AND НФО."ИМЯ_В_ИМИН_ПАДЕЖЕ" = 'вечерняя';


SELECT НГП."ПЛАН_ИД"
FROM "Н_ГРУППЫ_ПЛАНОВ" НГП
         JOIN "Н_ПЛАНЫ" НП on НГП."ПЛАН_ИД" = НП."ИД"
         JOIN "Н_ОТДЕЛЫ" НО on НП."ОТД_ИД" = НО."ИД"
WHERE НО."КОРОТКОЕ_ИМЯ" = 'КТиУ'
GROUP BY НГП."ПЛАН_ИД"
HAVING COUNT(*) > 2;


SELECT НУ."ГРУППА",
       AVG(date_part('year', age("ДАТА_РОЖДЕНИЯ"::date))) AS "Средний возраст"
FROM "Н_УЧЕНИКИ" НУ
         JOIN "Н_ЛЮДИ" НЛ on НУ."ЧЛВК_ИД" = НЛ."ИД"
GROUP BY НУ."ГРУППА"
HAVING AVG(date_part('year', age("ДАТА_РОЖДЕНИЯ"::date))) >
       (SELECT MIN(date_part('year', age(НЛ."ДАТА_РОЖДЕНИЯ"::date)))
        FROM "Н_УЧЕНИКИ" НУ
                 JOIN "Н_ЛЮДИ" НЛ on НУ."ЧЛВК_ИД" = НЛ."ИД" AND НУ."ГРУППА" = '3100');



SELECT НУ."ГРУППА",
       "Н_ЛЮДИ"."ИД",
       "Н_ЛЮДИ"."ФАМИЛИЯ",
       "Н_ЛЮДИ"."ИМЯ",
       "Н_ЛЮДИ"."ОТЧЕСТВО",
       НУ."П_ПРКОК_ИД",
       НУ."НАЧАЛО"
FROM "Н_УЧЕНИКИ" НУ
         JOIN "Н_ЛЮДИ" ON "Н_ЛЮДИ"."ИД" = НУ."ЧЛВК_ИД"
         JOIN "Н_ПЛАНЫ" ON НУ."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
         JOIN "Н_ФОРМЫ_ОБУЧЕНИЯ" ON "Н_ПЛАНЫ"."ФО_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
    AND ("Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Заочная' OR "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Очная')
         JOIN "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ" ON "Н_ПЛАНЫ"."НАПС_ИД" = "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."ИД"
         JOIN "Н_НАПР_СПЕЦ" ON "Н_НАПР_СПЕЦ"."ИД" = "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."НС_ИД"
    AND "Н_НАПР_СПЕЦ"."НАИМЕНОВАНИЕ" = 'Программная инженерия'
WHERE EXISTS(SELECT *
             FROM "Н_УЧЕНИКИ"
             WHERE "Н_УЧЕНИКИ"."НАЧАЛО" = '01-09-2012');

SELECT COUNT(*)
FROM (
         SELECT "Н_ЛЮДИ"."ИД"
         FROM "Н_ЛЮДИ"
                  JOIN "Н_УЧЕНИКИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД" AND
                                      "Н_УЧЕНИКИ"."ГРУППА" = '3100'
                  JOIN "Н_ВЕДОМОСТИ" ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД" AND
                                        "ОЦЕНКА" NOT IN ('осв', 'неявка', 'зачет', 'незач')
         GROUP BY "Н_ЛЮДИ"."ИД"
         HAVING AVG(CAST("ОЦЕНКА" AS NUMERIC)) >= 5.0
     ) as genious;


